---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCParallelFlange
source: html/b57802df-6b61-72c0-d4c9-ab2b7449696e.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCParallelFlange

Defines parameters for C-channel Parallel Flange structural section.

## Syntax (C#)
```csharp
public class StructuralSectionCParallelFlange : StructuralSectionGeneralU
```